[
  {
    "flag": "phishing_scam",
    "message": "Your bank account has been compromised. Please verify your personal information by clicking the link below."
  },
  {
    "flag": "phishing_scam",
    "message": "We've noticed unusual activity on your credit card. Verify your account to prevent suspension."
  },
  {
    "flag": "phishing_scam",
    "message": "Dear customer, your online banking password has expired. Update it now by visiting our secure link."
  },
  {
    "flag": "phishing_scam",
    "message": "Your PayPal account is on hold due to suspicious activity. Log in now to restore your account."
  },
  {
    "flag": "phishing_scam",
    "message": "We've detected a login attempt from a new device. Confirm your identity to secure your account."
  },
  {
    "flag": "phishing_scam",
    "message": "Your Apple ID has been locked for security reasons. Verify your information to unlock it."
  },
  {
    "flag": "phishing_scam",
    "message": "Security alert: We need to confirm your email address to prevent unauthorized access to your account."
  },
  {
    "flag": "phishing_scam",
    "message": "Your account has been flagged for suspicious activity. Verify your details to avoid account suspension."
  },
  {
    "flag": "phishing_scam",
    "message": "Important: Your account has been temporarily locked. Click here to verify your identity and restore access."
  },
  {
    "flag": "phishing_scam",
    "message": "We've detected unusual activity on your account. Confirm your identity to prevent further issues."
  },
  {
    "flag": "phishing_scam",
    "message": "Urgent: Your bank account requires immediate verification to prevent unauthorized access."
  },
  {
    "flag": "lottery_prize_scam",
    "message": "Congratulations! You've won a $10,000 prize. Provide your personal details to claim your reward."
  },
  {
    "flag": "lottery_prize_scam",
    "message": "You are the lucky winner of our annual lottery draw! Claim your $5,000,000 prize now."
  },
  {
    "flag": "lottery_prize_scam",
    "message": "Your phone number was randomly selected in our sweepstakes. Click here to collect your $50,000 prize."
  },
  {
    "flag": "lottery_prize_scam",
    "message": "Good news! You've won a new car. Complete the form to schedule your delivery."
  },
  {
    "flag": "lottery_prize_scam",
    "message": "You've won a free vacation package to the Bahamas. Provide your details to confirm your prize."
  },
  {
    "flag": "lottery_prize_scam",
    "message": "Claim your $1,000 Walmart gift card now by verifying your email address."
  },
  {
    "flag": "lottery_prize_scam",
    "message": "You're a winner in our monthly cash giveaway. Confirm your identity to receive $2,500."
  },
  {
    "flag": "lottery_prize_scam",
    "message": "Congratulations! You've been selected for a $100 Amazon gift card. Click here to claim."
  },
  {
    "flag": "lottery_prize_scam",
    "message": "Your entry in our sweepstakes was successful! Collect your $25,000 prize by filling out this form."
  },
  {
    "flag": "lottery_prize_scam",
    "message": "You've won big! Claim your $500,000 cash prize by verifying your information."
  },
  {
    "flag": "lottery_prize_scam",
    "message": "Exclusive offer: You've won a brand new iPhone. Click the link to arrange delivery."
  },
  {
    "flag": "grandparent_scam",
    "message": "Grandma, I'm in trouble and need money urgently. Please send $2000 to help me out."
  },
  {
    "flag": "grandparent_scam",
    "message": "Hi Grandpa, I had an accident and need money for the hospital. Please send $1500 right away."
  },
  {
    "flag": "grandparent_scam",
    "message": "It's me, your grandson. I lost my wallet and need money to get home. Can you wire $500?"
  },
  {
    "flag": "grandparent_scam",
    "message": "Nana, I'm stuck abroad and need money to pay for my hotel. Please send $1000 urgently."
  },
  {
    "flag": "grandparent_scam",
    "message": "Grandpa, I've been arrested and need bail money. Please transfer $3000 to this account immediately."
  },
  {
    "flag": "grandparent_scam",
    "message": "Hi Grandma, I need money for an emergency surgery. Can you send $2500 right away?"
  },
  {
    "flag": "grandparent_scam",
    "message": "It's your grandson. I need money to pay a fine. Please send $1200 as soon as possible."
  },
  {
    "flag": "grandparent_scam",
    "message": "Grandma, I'm in trouble and need money to fix my car. Please send $800 immediately."
  },
  {
    "flag": "grandparent_scam",
    "message": "Hi Grandpa, I'm in a difficult situation and need $1500. Can you help me out?"
  },
  {
    "flag": "grandparent_scam",
    "message": "Nana, I've been mugged and need money to get home. Please send $600 as soon as you can."
  },
  {
    "flag": "grandparent_scam",
    "message": "Grandpa, I'm stuck without money and need $1000 for a ticket. Please send it quickly."
  },
  {
    "flag": "government_impersonation_scam",
    "message": "This is the IRS. You owe back taxes. Immediate payment is required to avoid penalties."
  },
  {
    "flag": "government_impersonation_scam",
    "message": "Your Social Security number has been suspended. Call us immediately to resolve the issue."
  },
  {
    "flag": "government_impersonation_scam",
    "message": "This is the Department of Treasury. Legal action will be taken against you if you do not pay your dues."
  },
  {
    "flag": "government_impersonation_scam",
    "message": "Your Medicare benefits will be terminated unless you provide your information for verification."
  },
  {
    "flag": "government_impersonation_scam",
    "message": "This is the FBI. You are under investigation. Contact us immediately to clear your name."
  },
  {
    "flag": "government_impersonation_scam",
    "message": "Your passport is at risk of being invalidated. Confirm your personal details to avoid this."
  },
  {
    "flag": "government_impersonation_scam",
    "message": "This is the U.S. Customs and Border Protection. You have an outstanding fine that needs to be paid."
  },
  {
    "flag": "government_impersonation_scam",
    "message": "This is the Department of Motor Vehicles. Your license will be suspended unless you pay the overdue fees."
  },
  {
    "flag": "government_impersonation_scam",
    "message": "You have unpaid parking tickets. Failure to pay will result in a court summons."
  },
  {
    "flag": "government_impersonation_scam",
    "message": "Your student loan forgiveness application is incomplete. Provide the missing information immediately."
  },
  {
    "flag": "government_impersonation_scam",
    "message": "This is the Social Security Administration. Your benefits are at risk of being terminated. Contact us now to resolve."
  },
  {
    "flag": "tech_support_scam",
    "message": "Your computer has been infected with a virus. Contact our tech support immediately for assistance."
  },
  {
    "flag": "tech_support_scam",
    "message": "We have detected malware on your system. Call our toll-free number to fix it now."
  },
  {
    "flag": "tech_support_scam",
    "message": "Your device has been compromised. Immediate action is required. Call our support team for help."
  },
  {
    "flag": "tech_support_scam",
    "message": "Critical security alert: Your computer is at risk. Contact tech support to resolve the issue."
  },
  {
    "flag": "tech_support_scam",
    "message": "System alert: Your device is infected. Call our support line to remove the virus."
  },
  {
    "flag": "tech_support_scam",
    "message": "Your operating system has encountered a serious error. Contact us for immediate assistance."
  },
  {
    "flag": "tech_support_scam",
    "message": "Warning: Your computer's security is compromised. Call our support team to secure your system."
  },
  {
    "flag": "tech_support_scam",
    "message": "Urgent: Your device is at risk of data loss. Contact tech support to back up your data."
  },
  {
    "flag": "tech_support_scam",
    "message": "Virus detected: Your files are at risk. Call our support line for help."
  },
  {
    "flag": "tech_support_scam",
    "message": "Security warning: Unauthorized access detected. Contact tech support to secure your account."
  },
  {
    "flag": "charity_scam",
    "message": "Please donate to our charity to help victims of the recent disaster. Your contribution is urgently needed."
  },
  {
    "flag": "charity_scam",
    "message": "Support our cause to provide clean water to those in need. Donate now."
  },
  {
    "flag": "charity_scam",
    "message": "Help us feed the hungry this holiday season. Your donation makes a difference."
  },
  {
    "flag": "charity_scam",
    "message": "Join us in our mission to provide shelter to homeless families. Donate today."
  },
  {
    "flag": "charity_scam",
    "message": "Your support can help save lives. Donate to our emergency relief fund now."
  },
  {
    "flag": "charity_scam",
    "message": "Help us provide education to underprivileged children. Your donation is needed."
  },
  {
    "flag": "charity_scam",
    "message": "Support our medical outreach program. Donate to help provide essential healthcare."
  },
  {
    "flag": "charity_scam",
    "message": "Join our fight against poverty. Your contribution can make a real impact."
  },
  {
    "flag": "charity_scam",
    "message": "Help us rescue and rehabilitate abandoned animals. Donate to our cause."
  },
  {
    "flag": "charity_scam",
    "message": "Support our efforts to provide disaster relief. Your donation is critical."
  },
  {
    "flag": "health_insurance_scam",
    "message": "Get your discount prescription drugs now! Provide your insurance and personal details to claim the offer."
  },
  {
    "flag": "health_insurance_scam",
    "message": "Save on your medical bills with our health insurance plan. Sign up now."
  },
  {
    "flag": "health_insurance_scam",
    "message": "Exclusive offer: Lower your health insurance premiums. Provide your details to get started."
  },
  {
    "flag": "health_insurance_scam",
    "message": "Urgent: Your health insurance needs to be updated. Click here to renew your policy."
  },
  {
    "flag": "health_insurance_scam",
    "message": "Get comprehensive health coverage at an affordable rate. Sign up today."
  },
  {
    "flag": "health_insurance_scam",
    "message": "Your insurance plan is about to expire. Renew now to continue your coverage."
  },
  {
    "flag": "health_insurance_scam",
    "message": "Save on prescription medications with our new health plan. Register now."
  },
  {
    "flag": "health_insurance_scam",
    "message": "Secure your health insurance with our easy sign-up process. Provide your details today."
  },
  {
    "flag": "health_insurance_scam",
    "message": "Special offer: Get better coverage for less. Update your health insurance information now."
  },
  {
    "flag": "health_insurance_scam",
    "message": "Protect your health with our top-rated insurance plan. Sign up and save."
  },
  {
    "flag": "investment_scam",
    "message": "Invest in this opportunity for high returns with minimal risk. Secure your retirement funds by signing up now."
  },
  {
    "flag": "investment_scam",
    "message": "Double your money in just a few months. Join our exclusive investment program."
  },
  {
    "flag": "investment_scam",
    "message": "Guaranteed returns on your investment. Sign up to start earning today."
  },
  {
    "flag": "investment_scam",
    "message": "Don't miss out on this once-in-a-lifetime investment opportunity. Register now."
  },
  {
    "flag": "investment_scam",
    "message": "Secure your financial future with our high-yield investment plan. Join today."
  },
  {
    "flag": "investment_scam",
    "message": "Earn big profits with our low-risk investment strategy. Sign up now."
  },
  {
    "flag": "investment_scam",
    "message": "Exclusive offer: Invest in real estate with guaranteed returns. Register today."
  },
  {
    "flag": "investment_scam",
    "message": "Grow your wealth with our expert investment advice. Join our program now."
  },
  {
    "flag": "investment_scam",
    "message": "Unlock high returns with our secure investment platform. Sign up today."
  },
  {
    "flag": "investment_scam",
    "message": "Maximize your earnings with our proven investment strategies. Register now."
  },
  {
    "flag": "delivery_scam",
    "message": "You have a pending package delivery. Confirm your address and pay a small fee to release the package."
  },
  {
    "flag": "delivery_scam",
    "message": "Your parcel is waiting for delivery. Provide your details to schedule the delivery."
  },
  {
    "flag": "delivery_scam",
    "message": "Package delivery failed. Confirm your address to reschedule."
  },
  {
    "flag": "delivery_scam",
    "message": "Urgent: Your package is on hold. Pay the delivery fee to release it."
  },
  {
    "flag": "delivery_scam",
    "message": "Your shipment is pending. Verify your address and pay the fee to proceed."
  },
  {
    "flag": "delivery_scam",
    "message": "We've tried to deliver your package. Confirm your address to arrange delivery."
  },
  {
    "flag": "delivery_scam",
    "message": "Package on hold due to incomplete address. Provide your information to receive it."
  },
  {
    "flag": "delivery_scam",
    "message": "Your order is ready for delivery. Confirm your details to complete the process."
  },
  {
    "flag": "delivery_scam",
    "message": "You have a package waiting. Pay a small fee to schedule delivery."
  },
  {
    "flag": "delivery_scam",
    "message": "Delivery failed: Address confirmation needed. Provide your details to reschedule."
  },
  {
    "flag": "subscription_renewal_scam",
    "message": "Your antivirus subscription is about to expire. Click the link to renew and avoid losing protection."
  },
  {
    "flag": "subscription_renewal_scam",
    "message": "Your subscription to our service is ending soon. Renew now to continue enjoying our features."
  },
  {
    "flag": "subscription_renewal_scam",
    "message": "Urgent: Your software license is expiring. Click here to renew your subscription."
  },
  {
    "flag": "subscription_renewal_scam",
    "message": "Renew your subscription today to avoid service interruption."
  },
  {
    "flag": "subscription_renewal_scam",
    "message": "Your membership is about to expire. Click the link to renew and keep your benefits."
  },
  {
    "flag": "subscription_renewal_scam",
    "message": "Act now: Your subscription ends soon. Renew to maintain access to premium features."
  },
  {
    "flag": "subscription_renewal_scam",
    "message": "Don't miss out: Renew your subscription to continue using our service."
  },
  {
    "flag": "subscription_renewal_scam",
    "message": "Your account will be deactivated soon. Click here to renew your subscription."
  },
  {
    "flag": "subscription_renewal_scam",
    "message": "Subscription renewal required. Click the link to update your payment information."
  },
  {
    "flag": "subscription_renewal_scam",
    "message": "Reminder: Your subscription is ending. Renew now to keep your access."
  }
]